Repository: ran-huang/test-OmegaT
Catalog: project_save.tmx
Source language: zh_cn
Languages: en

source: TiDB Operator 是 Kubernetes 上的 TiDB 集群自动运维系统，提供包括部署、升级、扩缩容、备份恢复、配置变更的 TiDB 全生命周期管理。
en: TiDB Operator is an automatic operation system for TiDB clusters in Kubernetes. It provides a full management life-cycle for TiDB including deployment, upgrades, scaling, backup, fail-over, and configuration changes.

source: TiDB 集群升级
en: Upgrade TiDB Cluster

source: TiDB 集群备份与恢复
en: Back up and Restore a TiDB Cluster

source: TiDB 集群扩缩容
en: Scale TiDB Cluster

source: TiDB 集群配置变更
en: Change the Configuration of TiDB Cluster

source: 查看 TiDB 日志
en: View TiDB Logs in Kubernetes

source: 注意：
en: Note:

source: 监控 TiDB 集群
en: Monitor a TiDB Cluster in Kubernetes

source: 维护 TiDB 所在的 Kubernetes 节点
en: Maintain Kubernetes Nodes that Hold the TiDB Cluster

source: 访问 TiDB 集群
en: Access the TiDB Cluster

source: 部署 TiDB 集群
en: Deploy the TiDB Cluster

source: 配置 TiDB 集群故障自动转移
en: Automatic Failover

source: Kubernetes 上的 TiDB 提供了专用的命令行工具 tkctl 用于集群管理和辅助诊断，同时，在 Kubernetes 上，TiDB 的部分生态工具的使用方法也有所不同，你可以：
en: TiDB in Kubernetes provides a dedicated command-line tool tkctl for cluster management and auxiliary diagnostics. Meanwhile, some of TiDB's tools are used differently in Kubernetes. You can:

source: TiDB Operator 与适用的 TiDB 版本的对应关系如下：
en: The corresponding relationship between TiDB Operator and TiDB versions is as follows:

source: TiDB Operator 提供了多种方式来部署 Kubernetes 上的 TiDB 集群：
en: TiDB Operator provides several ways to deploy TiDB clusters in Kubernetes:

source: TiDB Operator 版本
en: TiDB Operator version

source: TiDB Operator 简介
en: TiDB Operator Overview

source: 使用 TiDB Operator 管理 TiDB 集群
en: Manage TiDB clusters using TiDB Operator

source: 借助 TiDB Operator，TiDB 可以无缝运行在公有云或私有部署的 Kubernetes 集群上。
en: With TiDB Operator, TiDB can run seamlessly in the Kubernetes clusters deployed on a public or private cloud.

source: 公有云：参考 AWS 部署文档，GKE 部署文档 (beta)，或阿里云部署文档在对应的公有云上一键部署生产可用的 TiDB 集群并进行后续的运维管理；
en: On public cloud: Deploy TiDB on AWS EKS，Deploy TiDB on GCP GKE (beta), orDeploy TiDB on Alibaba Cloud ACK.

source: 参考 tkctl 使用指南 来使用 tkctl；
en: Use tkctl according to tkctl Guide;

source: 参考 Kubernetes 上的 TiDB 故障诊断解决故障。
en: See Troubleshoot TiDB in Kubernetes to shoot troubles.

source: 参考 Kubernetes 上的 TiDB 相关工具使用指南来了解 TiDB 生态工具在 Kubernetes 上的使用方法。
en: See Tools in Kubernetes to understand how TiDB tools are used in Kubernetes.

source: 在任何环境上部署前，都可以参考 TiDB 集群配置来自定义 TiDB 配置。
en: Before deploying TiDB on any of the above two environments, you can always refer to TiDB Cluster Configuration Document.

source: 对于生产级 TiDB 集群，你还需要参考 TiDB 集群环境要求调整 Kubernetes 集群配置并根据本地 PV 配置为你的 Kubernetes 集群配置本地 PV，以满足 TiKV 的低延迟本地存储需求。
en: You also need to adjust the configuration of the Kubernetes cluster based on Prerequisites for TiDB in Kubernetes and configure the local PV for your Kubernetes cluster to achieve low latency of local storage for TiKV according to Local PV Configuration.

source: 当集群出现问题需要进行诊断时，你可以：
en: When a problem occurs and the cluster needs diagnosis, you can:

source: 最后，当 TiDB Operator 发布新版本时，你可以参考升级 TiDB Operator 进行版本更新。
en: Finally, when a new version of TiDB Operator is released, you can refer to Upgrade TiDB Operator to upgrade to the latest version.

source: 查阅 Kubernetes 上的 TiDB FAQ 寻找是否存在现成的解决办法；
en: See TiDB FAQs in Kubernetes for any available solution;

source: 每个 Kubernetes 集群中只能部署一个 TiDB Operator。
en: You can only deploy one TiDB Operator in a Kubernetes cluster.

source: 测试环境：
en: For test environment:

source: 现有 Kubernetes 集群：首先按照部署 TiDB Operator在集群中安装 TiDB Operator，再根据在标准 Kubernetes 集群上部署 TiDB 集群来部署你的 TiDB 集群。
en: In an existing Kubernetes cluster: First install TiDB Operator in a Kubernetes cluster according to Deploy TiDB Operator in Kubernetes, then deploy your TiDB clusters according to Deploy TiDB in General Kubernetes.

source: 生产环境：
en: For production environment:

source: 适用的 TiDB 版本
en: Compatible TiDB versions

source: 部署完成后，你可以参考下面的文档进行 Kubernetes 上 TiDB 集群的使用和运维：
en: After the deployment is complete, see the following documents to use, operate, and maintain TiDB clusters in Kubernetes:
